{"pageProps":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      h2: \"h2\",\n      p: \"p\",\n      a: \"a\",\n      blockquote: \"blockquote\",\n      h3: \"h3\",\n      ul: \"ul\",\n      li: \"li\",\n      br: \"br\"\n    }, _provideComponents(), props.components), {Tags} = _components;\n    if (!Tags) _missingMdxReference(\"Tags\", true);\n    return _jsxs(_Fragment, {\n      children: [_jsx(Tags, {\n        title: \"\",\n        tags: ['synthetic staining', 'classification', 'deep learning', 'pathology', 'neural networks']\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"Info\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"This is a backup of the case study published \", _jsx(_components.a, {\n          href: \"https://transform.england.nhs.uk/ai-lab/explore-all-resources/develop-ai/using-machine-learning-to-identify-patients-at-risk-of-long-term-hospital-stays/\",\n          children: \"here\"\n        }), \" on the NHS England Transformation Directorate website.\"]\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"Case Study\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Studies show that many patients who stay in hospital for extended periods experience negative outcomes: According to the Journal of Gerontology, “Ten days of bed rest in hospital leads to the equivalent of 10 years ageing in the muscles of people over 80” (Kortbein et al 2004). Long stays also create problems for busy hospitals because beds stay occupied for longer and require extra resources to manage. In this context, a long stay is regarded as any stay longer than 21 days.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"These longer length of stays are often avoidable, as one study showed 60% of immobile older patients had no medical reason that required bed rest (Graf 2006, American Journal of Nursing).\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The Business Intelligence team at Gloucestershire Hospital (GHFT), supported by GHFT's CIO and senior clinical leaders, developed an idea to use AI to address the issue of “long stayers” and was awarded a rapid feasibility project as part of the Skunkworks’ third round of competition at the NHS AI Lab.\"\n      }), \"\\n\", _jsxs(_components.blockquote, {\n        children: [\"\\n\", _jsx(_components.p, {\n          children: \"Long stayers at the Gloucestershire Hospitals Trust occupy an average of 278 beds per day, which is around 4% of all admissions but accounts for 34% of bed use. The ability to identify and intervene early could make a real difference to these patients.\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"Overview\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Sarah Hammond, Gloucestershire Hospitals’ Associate CIO, and Joe Green, Deputy Head of Business Intelligence, report that more than 30% of bed days in all of the Gloucestershire Trust’s acute hospitals are used by long stayers. It has been observed that long stayers have an 11% mortality rate during their hospital stay (compared to 5% of all admissions). Of these long stayers, 23% became unwell after being deemed medically fit for discharge (compared to 1% overall).\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Long stayers at the Gloucestershire Hospitals Trust occupy an average of 278 beds per day, which is around 4% of all admissions but accounts for 34% of bed use. The ability to identify and intervene early could make a real difference to these patients.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"After the completion of a rigorous Data Protection Impact Assessment (DPIA) and resulting Data Protection Agreement (DPA), the “longstayers” project had access to a good volume of data from over 7 years’ worth of admissions information. By analysing this data using machine learning methods (computer algorithms that learn from data), the team hoped to understand whether it is possible to identify the patients most at risk of becoming “longstayers”.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The challenge was to discover whether AI can provide a useful prediction solution. The follow up is whether that solution could be effectively and safely put into production and the results shared for wider use.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The project sought to:\"\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: \"predict which patients are most likely to become \\\"long stayers\\\" (stay in hospital for more than 21 days)\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"provide hospital staff with a prototype tool that provides a visible long stay risk score on every electronic patient record as soon as a new patient arrives at the hospital\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"maximise the learning opportunities from the project by working in the open and making the resulting source code available for continued - experimentation by other researchers and developers\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"contribute to potential better outcomes for people staying in hospitals around the country.\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"What we did\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Over a 12-week period, the project investigated an experimental approach to using AI to better understand the admissions data at Gloucestershire Hospitals. This rapid innovation is intended to explore a proof of concept that could help predict which patient will be a long stayer.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Data from more than 1 million admissions, stored in a secure SQL warehouse, was joined to an electronic patient record system to link key patient demographic indicators to each admission. The data available included age, sex, deprivation level, geography, and admission history like a patient’s presenting complaints, their socio-economic status, emergency department investigations and care home admissions.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"This provided a rich and ready dataset for the project using data that is owned and securely held by the trust. This therefore allowed the data to be used for research purposes when anonymised appropriately.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The team:\"\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: \"worked with clinicians to understand the problem and possible uses for the tool\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"developed an historical dataset for the project using patient admissions information\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"opted to progress a machine learning Generative Adversarial Networks (GANs) solution using an innovative AI algorithm\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"explained which factors contributed to the likelihood of a patient becoming a long-stayer (by building a parametric risk model)\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"tested how well the model worked against the expectations from the initial data analysis.\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"Why a GANs solution was chosen\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"GANs, first designed by \", _jsx(_components.a, {\n          href: \"https://arxiv.org/pdf/1406.2661.pdf\",\n          children: \"Ian Godfellow\"\n        }), \", involves simultaneously training two models. This includes a generative model that captures the data distribution, and a discriminative model that estimates the probability that a sample came from the training data.\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The Generative Adversarial Networks (GANs) was chosen because the use of the GANs to predict length of stay from a structured dataset offered a novel and experimental approach to a problem that may have been more commonly solved with models such as gradient boosted trees.\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"There are many types of GANs, for this project a deep-convolutional generative adversarial network (DC-GAN) was selected to predict the length of stay. This model architecture (which broadly followed the \", _jsx(_components.a, {\n          href: \"https://arxiv.org/abs/1511.06434\",\n          children: \"approach outlined here\"\n        }), \") allowed for flexibility with applications over a wide range of data processing problems and the ability to apply a convolutional methodology to mixed data.\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Through training it was clear that the discriminator portion of DC-GAN was most effective and that, combined with heuristics that were learned during an initial data-analysis phase, a new hybrid model could be used. Once the DC-GAN model had produced the length of stay estimate, this was fed into a risk model that used a cumulative density function model to produce a risk score for each patient’s likelihood of becoming a long-term hospital stayer. The final output was a risk score for that patient, from 1 to 5, with 5 being the highest risk.\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"The outcomes and lessons learned\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The project succeeded in achieving:\"\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: \"a “long stay risk” model that successfully detects two-thirds of long stayers and stratifies the risk in a useful way\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"identification of the factors that were predictive of long-stayers (specific to Gloucestershire)\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"a model performance accuracy within 1% at all stages when the model was tested on unseen data before, during and after the 2020 COVID waves.\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"This proof-of-concept risk identifier will enable hospital staff to look closely at whether the patients identified as having a high probability of a long stay could benefit from earlier interventions and changes to their care pathway.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The team at Gloucestershire Hospitals is keen to heed the lessons learned by working together, and taking the next steps to understand what technical, compliance, and logistical requirements are necessary to adopt it.\"\n      }), \"\\n\", _jsxs(_components.blockquote, {\n        children: [\"\\n\", _jsxs(_components.p, {\n          children: [\"Our aim was to develop a proof of concept for a “long stay risk” score algorithm. Would it be possible to predict a patient’s length of stay the minute they arrive at the front door? The initial “long stay risk” model successfully detects two-thirds of long stayers at time of arrival, or very soon after.\", _jsx(_components.br, {}), \"\\n\", \"– Joe Green, Deputy Head of Business Intelligence, Gloucestershire Hospitals Trust\"]\n        }), \"\\n\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The results have been very positive. It is hoped the information will allow trust staff to carefully tailor a patient’s care pathway accordingly. Based on a well-established evidence base showing the negative impacts of unnecessary long stays, the AI tool has the potential to lead to decrease in the length of hospital stays overall, with corresponding reductions in patient deterioration and mortality during admission, and also lead to reduced readmission rates.\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"What next?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Gloucestershire Hospitals Business Intelligence team reports: “We will soon begin taking the model output tables, which run every 15 minutes, into our electronic patient record system to test and evaluate with clinicians.“\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The Skunkworks team will continue to support Gloucestershire Hospitals with how to further test and evaluate the model, and adopt it safely into wider hospital use. The team is also preparing to support other organisations considering a similar approach.\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"Who was involved?\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"This project is a collaboration between NHSX, \", _jsx(_components.a, {\n          href: \"https://www.gloshospitals.nhs.uk/\",\n          children: \"Gloucestershire Hospitals NHS Foundation Trust\"\n        }), \", \", _jsx(_components.a, {\n          href: \"https://polygei.st/\",\n          children: \"Polygeist\"\n        }), \" and the Home Office’s \", _jsx(_components.a, {\n          href: \"https://www.gov.uk/government/groups/accelerated-capability-environment-ace\",\n          children: \"Accelerated Capability Environment\"\n        }), \" (ACE). The AI Lab Skunkworks exists within the NHS AI Lab to support the health and care community to rapidly progress ideas from the conceptual stage to a proof of concept.\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The NHS AI Lab is working with the Home Office programme: Accelerated Capability Environment (ACE) to develop some of its skunkworks projects, providing access to a large pool of talented and experienced suppliers who pitch their own vision for the project.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Accelerated Capability Environment (ACE) is part of the Homeland Security Group within the Home Office. It provides access to more than 250 organisations from across industry, academia and the third sector who collaborate to bring the right blend of capabilities to a given challenge. Most of these are small and medium-sized enterprises (SMEs) offering cutting-edge specialist expertise.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"ACE is designed to bring innovation at pace, accelerating the process from defining a problem to developing a solution and delivering practical impact to just 10 to 12 weeks.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Polygeist, a software company specialising in state-scale analytics, builds world-leading AI technology for defence, national security, law enforcement, and healthcare customers. The team for this project was able to produce a live system, producing insights, from a standing start, in 12 weeks.\"\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\nfunction _missingMdxReference(id, component) {\n  throw new Error(\"Expected \" + (component ? \"component\" : \"object\") + \" `\" + id + \"` to be defined: you likely forgot to import, pass, or provide it.\");\n}\n","frontmatter":{},"scope":{"title":"Using machine learning to identify patients at risk of long term hospital stays","summary":"Machine learning using historical data from Gloucestershire Hospitals NHS Foundation Trust to predict how long a patient will stay in hospital upon admission.","category":"CaseStudies"}},"meta":{"title":"Using machine learning to identify patients at risk of long term hospital stays","summary":"Machine learning using historical data from Gloucestershire Hospitals NHS Foundation Trust to predict how long a patient will stay in hospital upon admission.","category":"CaseStudies"}},"__N_SSG":true}