{"pageProps":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      h2: \"h2\",\n      p: \"p\",\n      a: \"a\",\n      h3: \"h3\",\n      ul: \"ul\",\n      li: \"li\",\n      h4: \"h4\"\n    }, _provideComponents(), props.components), {Tags} = _components;\n    if (!Tags) _missingMdxReference(\"Tags\", true);\n    return _jsxs(_Fragment, {\n      children: [_jsx(Tags, {\n        title: \"\",\n        tags: ['ct', 'computer vision', 'image registration', 'lesion detection']\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"Info\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"This is a backup of the case study published \", _jsx(_components.a, {\n          href: \"https://transform.england.nhs.uk/ai-lab/explore-all-resources/develop-ai/using-ai-to-identify-tissue-growth-from-ct-scans/\",\n          children: \"here\"\n        }), \" on the NHS England Transformation Directorate website.\"]\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"Case Study\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"George Eliot Hospital approached the NHS AI Lab Skunkworks team with an idea to use AI to speed up the analysis of computerised tomography (CT) scans.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"CT scans are used in the detection and understanding of disease. Radiologists currently manually compare two CT scans, taken at different dates, to see whether a patient’s disease has improved, deteriorated or remained unchanged.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"This 12-week project investigated the AI techniques that could be applied to the problem and sought to provide a proof of concept (a feasibility study) about whether it was possible to identify organs and growths, report on any changes and highlight areas of concern to the radiologist.\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"Overview\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"There are a number of challenges for radiologists reviewing cancer patients by comparing CT scans:\"\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: \"Review is time-consuming. It typically takes 30 to 40 minutes to assess scans for each patient.\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"They must check if there has been growth through multiple dimensions, but can only check one dimension at a time. Growth changes that look minimal in one dimension may be significant if viewed in 3D.\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"The manual alignment of images is not precise because of variations in the position of the patient’s body between scans.\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"It is not easy to see small or developing growths, increasing the possibility of missed detection. In the abdomen, for example, radiologists are reportedly making differing interpretations in up to 37% of cases. (Siewert, 2008)\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"The NHS AI Lab Skunkworks funded and supported an AI investigation with the team at George Eliot Hospital, alongside Roke, an AI specialist supplier provided through the Home Office’s \", _jsx(_components.a, {\n          href: \"https://transform.england.nhs.uk/ai-lab/explore-all-resources/develop-ai/using-ai-to-identify-tissue-growth-from-ct-scans/#who\",\n          children: \"Accelerated Capability Environment (ACE)\"\n        }), \".\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The work looked at whether AI could be used to identify features in a CT scan and automatically align images to provide radiologists with a quick, trustworthy support tool that would improve early detection and diagnosis of growths and improve patient outcomes. The team aimed to:\"\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: \"provide fast, automatic overlay of scans to enable tissue growth comparison in 2D and 3D\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"successfully align scans despite changes in body shape (caused by breathing during scanning, or weight gain and loss between scans)\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"identify different parts of the body (bone, organs and tissue growth)\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"automatically measure tissue growth, in 2D and 3D\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"detect anomalies (new growths or changes not present in previous scans)\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"What we did\"\n      }), \"\\n\", _jsx(_components.h4, {\n        children: \"Tissue sectioning\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Before detecting anomalies, the tool needs to separate the various types of tissue present in a scan (bone, fat, organs). The team first tried the recently released Facebook self-supervised learning method “DINO”, but found that this method was less accurate on CT scans than other approaches and required large amounts of memory to process. Instead, the team proceeded with a texton approach. Textons are micro-structures in images, or ‘groups’ of pixels, that can be recognised visually before the whole image is.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The process involved applying machine learning (where an algorithm gradually improves its accuracy through repeated exposure to new data like scans and images) to the use of textons. This method was able to identify and differentiate between different tissue types accurately and rapidly.\"\n      }), \"\\n\", _jsx(_components.h4, {\n        children: \"Anomaly detection\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Much like the process humans take in distinguishing between objects, classifying them and sorting them by size, computer vision takes an image input and gives output in the form of information, for example on size or colour. To detect anomalies, the team tried two methods: ellipsoid detection and infill prediction.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Ellipsoid detection aims to isolate rounded 3D volumes of tissue, which were expected to correlate with lesions more strongly than other geometric shapes and identify those which differ from their surroundings. Infill prediction aims to learn what the parts of an image should look like in order to recognise anomalies that shouldn’t be there. A combination of the two methods was found to be the most accurate at detecting lesions, while manually ignoring anomalies that aren’t of concern, for example pockets of air inside the body.\"\n      }), \"\\n\", _jsx(_components.h4, {\n        children: \"Scan alignment\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"As well as automatically detecting lesions, the project was designed to keep a ‘human in the loop’ and act as a support for radiologists conducting examinations. To do this, three methods were tested for aligning two scans from the same patient, usually taken months apart, in 2D and 3D: keypoint alignment, phase correlation and coherent point drift. Phase correlation was found to be the most robust but did not deal with body shape changes, while coherent point drift was most effective for aligning scans while taking into account any body shape changes.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The tool allows the user to choose which of the three adjustment options provides the best alignment for each case.\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"Outcomes and lessons learned\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The hoped-for benefits of the project have had some partial successes:\"\n      }), \"\\n\", _jsx(_components.h4, {\n        children: \"Scan alignment\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The team achieved both rigid and non-rigid 3D alignment that were an improvement on manual alignment but not perfect. The methods used to deal with difficulties caused by patients inhaling or exhaling during scanning were observed to work in most cases.\"\n      }), \"\\n\", _jsx(_components.h4, {\n        children: \"Overlay\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Precise overlay of scans was achieved in the tool created both for 3D and 2D images, including when zooming, rotating or panning the image.\"\n      }), \"\\n\", _jsx(_components.h4, {\n        children: \"New tissue growth detection\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Anomaly sizes were measured in 3D but more work is needed for robust correspondence between existing lesions to measure change.3D to successfully aid the identification of new growths.\"\n      }), \"\\n\", _jsx(_components.h4, {\n        children: \"Time saving\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Further development and testing is required to establish a reduction in radiologists’ time, but the tool provides a process that is less manual for radiologists.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"George Eliot Hospital provided anonymised CT scans from 100 patients with tissue growths, and a number of marked-up scans to be used as “ground truth” data. In order to progress this work further, greater numbers of scans are needed to provide quantitative metrics of success.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Integration of novel image processing techniques with existing scanner software also needs to be explored to minimise friction in the workflow for radiologists.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Further exploration is also needed to identify and compare techniques and approaches that have already been tried by the medical imaging community.\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"What next?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"George Eliot Hospital and Roke have submitted a joint application for further funding through the AI Award to further test the tool and establish a rigorous evaluation ahead of any regulatory work that will be required to use the software in clinical workflow.\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"The team are testing these techniques against the latest techniques demonstrated as part of the Medical Image Computing and Computer Assisted Intervention (\", _jsx(_components.a, {\n          href: \"http://www.miccai.org/\",\n          children: \"MICCAI\"\n        }), \") conferences.\"]\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"Who was involved?\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"This project is a collaboration between NHSX, \", _jsx(_components.a, {\n          href: \"http://www.geh.nhs.uk/\",\n          children: \"George Eliot Hospital\"\n        }), \", and \", _jsx(_components.a, {\n          href: \"https://www.roke.co.uk/\",\n          children: \"Roke\"\n        }), \" who were selected through the Home Office’s \", _jsx(_components.a, {\n          href: \"https://www.gov.uk/government/groups/accelerated-capability-environment-ace\",\n          children: \"Accelerated Capability Environment\"\n        }), \" (ACE). The AI Lab Skunkworks exists within the NHS AI Lab to support the health and care community to rapidly progress ideas from the conceptual stage to a proof of concept.\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The NHS AI Lab is working with the Home Office programme: Accelerated Capability Environment (ACE) to develop some of its skunkworks projects, providing access to a large pool of talented and experienced suppliers who pitch their own vision for the project.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Accelerated Capability Environment (ACE) is part of the Homeland Security Group within the Home Office. It provides access to more than 250 organisations from across industry, academia and the third sector who collaborate to bring the right blend of capabilities to a given challenge. Most of these are small and medium-sized enterprises (SMEs) offering cutting-edge specialist expertise.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"ACE is designed to bring innovation at pace, accelerating the process from defining a problem to developing a solution and delivering practical impact to just 10 to 12 weeks.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Roke is a long-established science and engineering organisation, providing AI and machine learning expertise and lending technical capabilities to projects with NHS AI Lab Skunkworks.\"\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\nfunction _missingMdxReference(id, component) {\n  throw new Error(\"Expected \" + (component ? \"component\" : \"object\") + \" `\" + id + \"` to be defined: you likely forgot to import, pass, or provide it.\");\n}\n","frontmatter":{},"scope":{"title":"Using AI to identify tissue growth from CT scans","summary":"A range of classical and machine learning computer vision techniques to align and detect lesions in anomyised CT scans over time from George Eliot Hospital NHS Trust.","category":"CaseStudies"}},"meta":{"title":"Using AI to identify tissue growth from CT scans","summary":"A range of classical and machine learning computer vision techniques to align and detect lesions in anomyised CT scans over time from George Eliot Hospital NHS Trust.","category":"CaseStudies"}},"__N_SSG":true}